In [2]:
import sqlite3
import pandas as pd

In [3]:
# Create a database in memory
conn = sqlite3.connect("university.db")
cursor = conn.cursor()

In [4]:
# create a table
cursor.execute("DROP TABLE IF EXISTS students")
cursor.execute(
          '''CREATE TABLE students(
          student_id INTEGER PRIMARY KEY,
          name TEXT NOT NULL,
          class TEXT NOT NULL,
          course_id INTEGER,
          score FLOAT NOT NULL
          )'''
          )

In [5]:
cursor.execute("DROP TABLE IF EXISTS course")

cursor.execute(''' 
                CREATE TABLE course(
                id INTERGER PRIMARY KEY,
                course_name TEXT NOT NULL)''')

conn.commit()

In [6]:
cursor.executescript('''
INSERT INTO students (student_id, name, class, course_id, score) VALUES
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7),
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2),
(3, 'Pham Van Nam', 'Toan Tin',NULL ,7.9),
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2),
(5, 'Vu Quoc Anh', 'Toan Tin', 24, 8.0),
(6, 'Dang Thuy Linh', 'May Tinh', 24, 8.0),
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2),
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8),
(9, 'Dang Huu Phuoc', 'Kinh Te',NULL ,7.2),
(10,'Cao Thi Hanh','May Tinh',NULL ,7.0);

INSERT INTO course (id, course_name) VALUES
(12,'Giai Tich'),
(34, 'Thong Ke'),
(26, 'Tin hoc');
''')

conn.commit

In [7]:
cursor.execute("select * from students")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7)
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2)
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2)
(5, 'Vu Quoc Anh', 'Toan Tin', 24, 8.0)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 8.0)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2)
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8)
(9, 'Dang Huu Phuoc', 'Kinh Te', None, 7.2)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0)

In [8]:
cursor.execute("select * from course")
rows = cursor.fetchall()
for row in rows:
    print(row)

(12, 'Giai Tich')
(34, 'Thong Ke')
(26, 'Tin hoc')

In [9]:
''' kết nối hai bảng '''
# 1. sử dụng Decartes
cursor.execute("select * from students, course")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai Tich')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 34, 'Thong Ke')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 26, 'Tin hoc')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 12, 'Giai Tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 26, 'Tin hoc')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 12, 'Giai Tich')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 34, 'Thong Ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 26, 'Tin hoc')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 12, 'Giai Tich')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 34, 'Thong Ke')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 26, 'Tin hoc')
(5, 'Vu Quoc Anh', 'Toan Tin', 24, 8.0, 12, 'Giai Tich')
(5, 'Vu Quoc Anh', 'Toan Tin', 24, 8.0, 34, 'Thong Ke')
(5, 'Vu Quoc Anh', 'Toan Tin', 24, 8.0, 26, 'Tin hoc')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 8.0, 12, 'Giai Tich')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 8.0, 34, 'Thong Ke')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 8.0, 26, 'Tin hoc')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 12, 'Giai Tich')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 26, 'Tin hoc')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 12, 'Giai Tich')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 34, 'Thong Ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 26, 'Tin hoc')
(9, 'Dang Huu Phuoc', 'Kinh Te', None, 7.2, 12, 'Giai Tich')
(9, 'Dang Huu Phuoc', 'Kinh Te', None, 7.2, 34, 'Thong Ke')
(9, 'Dang Huu Phuoc', 'Kinh Te', None, 7.2, 26, 'Tin hoc')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 12, 'Giai Tich')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 34, 'Thong Ke')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, 26, 'Tin hoc')

In [10]:
# 2. sử dụng joins
cursor.execute("select * from students,course where students.course_id = course.id")
rows = cursor.fetchall()
for row in rows:
               print(row)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai Tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')

In [11]:
# sử dụng inner join == joins
cursor.execute("select * from students inner join course on students.course_id = course.id")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai Tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')

In [12]:
# sử dụng left join
cursor.execute("select * from students left join course on students.course_id = course.id")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai Tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None, None)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None, None)
(5, 'Vu Quoc Anh', 'Toan Tin', 24, 8.0, None, None)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 8.0, None, None)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None, None)
(9, 'Dang Huu Phuoc', 'Kinh Te', None, 7.2, None, None)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None, None)

In [13]:
# sử dụng right join
cursor.execute("select * from students right join course on students.course_id = course.id")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai Tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(None, None, None, None, None, 26, 'Tin hoc')

In [14]:
# sử dụng full outer  join
cursor.execute("select * from students full outer join course on students.course_id = course.id")
rows = cursor.fetchall()
for row in rows:
    print(row)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai Tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None, None)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None, None)
(5, 'Vu Quoc Anh', 'Toan Tin', 24, 8.0, None, None)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 8.0, None, None)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None, None)
(9, 'Dang Huu Phuoc', 'Kinh Te', None, 7.2, None, None)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7.0, None, None)
(None, None, None, None, None, 26, 'Tin hoc')

INNER JOIN: Chỉ lấy bản ghi có course_id = id
LEFT JOIN: Giữ tất cả sinh viên, kể cả khi họ không có khóa học (course_name = NULL)
RIGHT JOIN: Giữ tất cả khóa học, kể cả khi không có sinh viên nào (student_id = NULL)
FULL OUTER JOIN: Giữ cả sinh viên và khóa học, ngay cả khi không khớp
Dùng WHERE ... IS NULL để lọc ra các bản ghi không khớp

In [15]:
cursor.execute("""update students 
                    set course_id = (select id from course order by RANDOM() Limit 1) 
                    where course_id is null""")

conn.commit()

In [16]:
cursor.execute("""
                delete from students
                where course_id not in (select id from course)""")
conn.commit()

In [17]:
cursor.execute("""
                    select * 
                    from students""")
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7)
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2)
(3, 'Pham Van Nam', 'Toan Tin', 34, 7.9)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2)
(9, 'Dang Huu Phuoc', 'Kinh Te', 34, 7.2)
(10, 'Cao Thi Hanh', 'May Tinh', 34, 7.0)

In [18]:
# average score of each class
cursor.execute("""
                select class,count(student_id) as count_number,avg(score)
                from students
                Group by class""")
rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["Class","count_number", "Average Score"])

# In bảng đẹp hơn
print("Tổng số sinh viên, điểm trung bình của từng lớp học")
print(df)

Tổng số sinh viên, điểm trung bình của từng lớp học
      Class  count_number  Average Score
0   Kinh Te             3       8.533333
1  May Tinh             2       6.850000
2  Toan Tin             1       7.900000

In [19]:
# average score of each subject
cursor.execute("""
                select course_id,count(student_id) as count_number,avg(score), course_name
                from students, course
                where students.course_id = course.id
                group by course_id""")
rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["course_id","count_number", "Average Score", "course name"])

# In bảng đẹp hơn
print("Tổng số sinh viên, điểm trung bình của từng môn học")
print(df)

Tổng số sinh viên, điểm trung bình của từng môn học
   course_id  count_number  Average Score course name
0         12             1            6.7   Giai Tich
1         34             5            8.1    Thong Ke

In [20]:
# classificaiton score with each subject 
# average score of each subject
cursor.execute("""
                select course_id,count(student_id) as count_number,avg(score),course_name,
                case
                    when avg(score) >= 9.0 then "xuat sac"
                    when avg(score) >= 6.0 and avg(score) <= 8.9 then "tot"
                    else "kem"
                end as "category"
                from students, course
                where students.course_id = course.id
                group by course_id""")
rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["course_id","count_number", "Average Score", "course name","category"])

# In bảng đẹp hơn
print(df)

   course_id  count_number  Average Score course name category
0         12             1            6.7   Giai Tich      tot
1         34             5            8.1    Thong Ke      tot

In [21]:
cursor.execute("""
                select name, score,
                row_number() over (order by score DESC,name ASC) as ranked
                from students""")
rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["name", "score","ranked"])

# In bảng đẹp hơn
print(df)
print("\n")
print("3 sinh vien cao điểm nhất")
print(df.iloc[:3,:])
print("\n")
print("3 sinh viên thấp điểm nhất")
print(df.iloc[-3:,:])

                name  score  ranked
0      Bui Tien Dung    9.2       1
1       Tran Thi Lan    9.2       2
2       Pham Van Nam    7.9       3
3     Dang Huu Phuoc    7.2       4
4       Cao Thi Hanh    7.0       5
5  Nguyen Minh Hoang    6.7       6


3 sinh vien cao điểm nhất
            name  score  ranked
0  Bui Tien Dung    9.2       1
1   Tran Thi Lan    9.2       2
2   Pham Van Nam    7.9       3


3 sinh viên thấp điểm nhất
                name  score  ranked
3     Dang Huu Phuoc    7.2       4
4       Cao Thi Hanh    7.0       5
5  Nguyen Minh Hoang    6.7       6

In [22]:
cursor.execute("""
                select name, score, class,
                row_number() over (partition by class order by score DESC,name ASC) as ranked
                from students""")
rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["name", "score","class","ranked"])

# In bảng đẹp hơn
print(df)
print("\n")
print("3 sinh vien cao điểm nhất của từng lớp")
top_class = df[df["ranked"] <= 3]
print(top_class)

                name  score     class  ranked
0      Bui Tien Dung    9.2   Kinh Te       1
1       Tran Thi Lan    9.2   Kinh Te       2
2     Dang Huu Phuoc    7.2   Kinh Te       3
3       Cao Thi Hanh    7.0  May Tinh       1
4  Nguyen Minh Hoang    6.7  May Tinh       2
5       Pham Van Nam    7.9  Toan Tin       1


3 sinh vien cao điểm nhất của từng lớp
                name  score     class  ranked
0      Bui Tien Dung    9.2   Kinh Te       1
1       Tran Thi Lan    9.2   Kinh Te       2
2     Dang Huu Phuoc    7.2   Kinh Te       3
3       Cao Thi Hanh    7.0  May Tinh       1
4  Nguyen Minh Hoang    6.7  May Tinh       2
5       Pham Van Nam    7.9  Toan Tin       1

In [23]:
cursor.execute("""
                select name, score, class,
                row_number() over (partition by class order by score ASC,name ASC) as ranked
                from students""")
rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["name", "score","class","ranked"])
print("\n")
print("3 sinh viên thấp điểm nhất của từng lớp")
bottom_class = df[df["ranked"] <= 3]
print(bottom_class)

3 sinh viên thấp điểm nhất của từng lớp
                name  score     class  ranked
0     Dang Huu Phuoc    7.2   Kinh Te       1
1      Bui Tien Dung    9.2   Kinh Te       2
2       Tran Thi Lan    9.2   Kinh Te       3
3  Nguyen Minh Hoang    6.7  May Tinh       1
4       Cao Thi Hanh    7.0  May Tinh       2
5       Pham Van Nam    7.9  Toan Tin       1

In [24]:
cursor.execute("""
                select name, score, course_id,
                row_number() over (partition by course_id order by score DESC,name ASC) as ranked
                from students""")
rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["name", "score","course_id","ranked"])

# In bảng đẹp hơn
print(df)

print("top 3 sinh vien cao điểm nhất theo mã môn học")
top_course = df[df["ranked"] <= 3]
print(top_course)

                name  score  course_id  ranked
0  Nguyen Minh Hoang    6.7         12       1
1      Bui Tien Dung    9.2         34       1
2       Tran Thi Lan    9.2         34       2
3       Pham Van Nam    7.9         34       3
4     Dang Huu Phuoc    7.2         34       4
5       Cao Thi Hanh    7.0         34       5
top 3 sinh vien cao điểm nhất theo mã môn học
                name  score  course_id  ranked
0  Nguyen Minh Hoang    6.7         12       1
1      Bui Tien Dung    9.2         34       1
2       Tran Thi Lan    9.2         34       2
3       Pham Van Nam    7.9         34       3

In [25]:
cursor.execute("""
                select name, score, course_id,
                row_number() over (partition by course_id order by score ASC,name ASC) as ranked
                from students""")
rows = cursor.fetchall()

df = pd.DataFrame(rows, columns=["name", "score","course_id","ranked"])



print("top 3 sinh vien thấp điểm nhất theo mã môn học")
top_course = df[df["ranked"] <= 3]
print(top_course)

top 3 sinh vien thấp điểm nhất theo mã môn học
                name  score  course_id  ranked
0  Nguyen Minh Hoang    6.7         12       1
1       Cao Thi Hanh    7.0         34       1
2     Dang Huu Phuoc    7.2         34       2
3       Pham Van Nam    7.9         34       3